class ServiceCategory {
  final String name;
  final List<String> subServices;

  ServiceCategory({required this.name, required this.subServices});
}

final List<ServiceCategory> mockServiceCategories = [
  ServiceCategory(
    name: "ช่างทาสี",
    subServices: [
      "ทาสีภายในอาคาร",
      "ทาสีภายนอกอาคาร",
      "ทาสีรั้วบ้าน",
      "ทาสีหลังคาบ้าน (Bager, Synotex)",
      "ทาสีเฟอร์นิเจอร์ไม้",
      "สำรวจทาสี",
    ],
  ),
  ServiceCategory(
    name: "ช่างประปา",
    subServices: [
      "ซ่อมท่อน้ำรั่ว / ท่อแตก",
      "ติดตั้งอ่างล้างหน้า",
      "ล้างถังพักน้ำ / แทงก์น้ำ",
      "ติดตั้งปั๊มน้ำ",
      "ติดตั้งสุขภัณฑ์ธรรมดา",
      "ติดตั้งสุขภัณฑ์อัตโนมัติ",
      "ซ่อมท่ออุดตัน / ส้วมตัน",
      "ติดตั้งเครื่องทำน้ำอุ่น (แบบเดิน)",
      "ติดตั้งเครื่องทำน้ำอุ่น (แบบจั๊ม)",
    ],
  ),
  ServiceCategory(
    name: "ช่างไฟฟ้า",
    subServices: [
      "ติดตั้งปลั๊กไฟ / สวิตช์ไฟ",
      "เปลี่ยนปลั๊กไฟ / สวิตช์ไฟ",
      "ติดตั้งเบรกเกอร์",
      "ซ่อมไฟไม่ติด / ไฟช็อต",
      "ตรวจสอบระบบไฟฟ้าในบ้าน",
    ],
  ),
  ServiceCategory(
    name: "ช่างซ่อมเครื่องใช้ไฟฟ้า",
    subServices: [
      "ซ่อมแอร์",
      "ล้างแอร์",
      "ซ่อมตู้เย็น",
      "ซ่อมเครื่องซักผ้า / เครื่องอบผ้า",
      "ซ่อมเตาอบ / เตาไมโครเวฟ",
      "ซ่อมทีวี ขนาด 19 - 35 นิ้ว",
      "ซ่อมทีวี ขนาด 36 - 60 นิ้ว",
      "ซ่อมทีวี ขนาดมากกว่า 60 นิ้ว",
      "ติดตั้งพัดลมติดผนัง",
      "ติดตั้งพัดลมดูดอากาศ",
      "เปลี่ยนดาวน์ไลท์ / ไฟเพดาน",
      "ติดตั้งไฟฉุกเฉิน",
      "ติดตั้งกล้องวงจรปิด",
    ],
  ),
];
